cases/nucleateBoiling_BuresSato/singlePhase/0.orig/fluid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField  uniform 0;

boundaryField
{
    fluid_to_heater
    {
        type            fixedFluxPressure;
    }

    side
    {
        //type            zeroGradient;
	type            totalPressure;
        p0              uniform 0;
    }

    top
    {
        //type            fixedValue;
        //value           uniform 0;
	type            totalPressure;
        p0              uniform 0;
    }

front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

    axis
    {
        type             empty;
    }
}

// ************************************************************************* //
